from multiprocessing import Pipe, Process
import os

"""
Pipe (труба/канал) — это двухсторонний канал связи между процессами, который предоставляет пару соединённых объектов для обмена данными.
conn.send(obj)	Отправляет объект через соединение
conn.recv()	Принимает объект (блокируется, пока не получит)
conn.poll([timeout])	Проверяет, есть ли данные для чтения
conn.close()	Закрывает соединение
conn.fileno()	Возвращает файловый дескриптор

Сравнение Pipe vs Queue:
Характеристика       	            Pipe	       Queue
Скорость	                  🚀 Быстрее  	|  🐢  Медленнее
Количество процессов	       Только 2	    |     Много
Потокобезопасность	           ❌ Нет	    |  ✅ Да
Двусторонность	        ✅ Да (опционально)	|  ❌ Нет (односторонняя)
Простота использования	        Средняя	            |     Высокая

"""

def worker(p: Pipe):
    some_date = 100500
    p.send(some_date)

def two_wworker(obj, p: Pipe):

    p.send(obj)
    print(f'Передали {obj} в ядро ОС')


if __name__ == '__main__':
    print(f'Родительский процесс {os.getpid()}')
    parent_pipe, child_pipe = Pipe()
    p = Process(target=worker, args=(child_pipe,))
    p.start()
    p2 = Process(target=two_wworker, args=(child_pipe,))
    p2.start()
    print(f'Информация из дочернего процесса {os.getpid()} вернула: {parent_pipe.recv()}')
    parent_pipe.send("Информация из главного процесса")
    """на этапе recv мы получаем копию из ядра ОС и после получения объект удаляется от туда"""
    print(parent_pipe.recv())
    print(child_pipe.recv()) # на этом этапе мы исчерпали все объекты между двумя процессами
    print(child_pipe.poll()) # так как объектов для передачи нет то будет False
    parent_pipe.send('ещё что то передали') # появился объект в poll и его ещё не вызвали
    print(child_pipe.poll()) # True
    p.join()
    p2.join()

    """         
    Подход	           Безопасность	    Производительность	    Сложность
    Pipe без lock	     ❌ Опасно	    🚀 Высокая	               🟢 Низкая
    Pipe + lock	        ✅ Безопасно	🐢 Средняя	               🟡 Средняя
    Queue	            ✅ Безопасно	🐢 Средняя	               🟢 Низкая
    """
